Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: You can edit the message the same as always, but it overwrites your previous commit.
cs: Zprávu můžete editovat stejným způsobem jako vždy, ale předchozí revize se přepíše.

source: You can either install it as a package or via another installer, or download the source code and compile it yourself.
cs: Buď jej můžete nainstalovat jako balíček nebo přes nějaký jiný instalátor, nebo můžete stáhnout jeho zdrojový kód a zkompilovat ho.

source: You can exclude commits in the master branch by adding the `--not` option before the branch name.
cs: Revize v hlavní větvi lze vyloučit vložením parametru `--not` před název větve.

source: You can get a Git project using two main approaches.
cs: Projekt lze v Gitu získat dvěma základními způsoby.

source: You can get a full list of remote references explicitly with `git ls-remote (remote)`, or `git remote show (remote)` for remote branches as well as more information.
cs: Seznam vzdálených referencí pro vzdálené větve a také další informace můžete získat explicitním příkazem `git ls-remote (vzdálený)` nebo `git remote show (vzdálený)` footnote:[Pozn. překl.: V originále je příkaz zapsán jako `git remote show (remote)`, přičemž první „remote“ je název příkazu a druhé slovo „remote“ v závorkách je symbolické vyjádření, že se zde má uvést jméno „vzdáleného“... a teď čeho. Na jiných místech v knize se volněji pracuje s pojmy „server“ nebo „repozitář“ ve smyslu gitového serveru nebo repozitáře. V této kapitole bychom měli být přesnější, protože pojem „remote“ musíme navíc spojit s větvemi. Přesnější je použít spojení „vzdálený repozitář“, protože z hlediska Gitu není důležité, jakou podobu toto „úložiště dat“ má. Může to být „server“, ale může to být také „adresář na lokálním disku“. V anglicky mluvící komunitě si s tím hlavu nelámou a nazývají to prostě „remote“, přičemž mají současně na mysli „krátké jméno vzdáleného repozitáře“. Podle jejich vzoru proto ponechávám pro druhý výskyt tohoto slova v příkladu český překlad „vzdálený“.].

source: You can get a list of the SHA-1 values of all the commits that are being pushed by taking the `$newrev` and `$oldrev` values and passing them to a Git plumbing command called `git rev-list`.
cs: Vezmete-li hodnoty `$newrev` a `$oldrev` a zadáte je k nízkoúrovňovému příkazu `git rev-list`, získáte seznam hodnot SHA-1 všech odesílaných revizí.

source: You can get it via the Kernel.org site, at https://www.kernel.org/pub/software/scm/git[], or the mirror on the GitHub web site, at https://github.com/git/git/releases[].
cs: Najdete jej na serveru Kernel.org na stránce https://www.kernel.org/pub/software/scm/git[] nebo jeho kopii na webovém serveru GitHub na stránce https://github.com/git/git/releases[].

source: You can have Git tell you the object type of any object in Git, given its SHA-1 key, with `cat-file -t`:
cs: Zadáte-li příkaz `cat-file -t` v kombinaci s klíčem SHA-1 objektu, Git vám sdělí jeho typ, ať se jedná o jakýkoli objekt Git.

source: You can have several of them, each of which generally is either read-only or read/write for you.
cs: Vzdálených repozitářů můžete mít několik, každý pro vás bude přístupný buď pouze pro čtení (read-only) nebo pro čtení i zápis (read/write).

source: You can insert any kind of content into it, and it will give you back a key that you can use to retrieve the content again at any time.
cs: Můžete do něj vložit jakýkoli obsah a na oplátku dostanete klíč, který můžete kdykoli v budoucnu použít k vyzvednutí obsahu.

source: You can keep doing this for several levels of stability.
cs: Takto můžete pokračovat pro několik úrovní stability.

source: You can keep the changes there for minutes, days, or months, and merge them in when they're ready, regardless of the order in which they were created or worked on.
cs: Změny v nich můžete uchovávat několik minut, dní i měsíců a začlenit je až ve vhodnou chvíli -- nezávisle na pořadí, v jakém vznikly nebo byly vyvíjeny.

source: You can look into the packfile and see what Git did to save space.
cs: Do balíčkového souboru můžete ostatně nahlédnout a přesvědčit se, čím Git ušetřil místo.

source: You can make Git read and write to this file by passing the `--global` option.
cs: Git bude načítat a zapisovat výhradně do tohoto souboru, jestliže zadáte parametr `--global`.

source: You can make Git read and write to this file specifically by passing the `--global` option.
cs: Čtení a zápis do tohoto souboru zajistíte zadáním parametru `--global`.

source: You can make a lightweight tag by running something like this:
cs: Prostou značku lze vytvořit spuštěním například tohoto příkazu:

source: You can modify that message with details about how you resolved the merge if you think it would be helpful to others looking at this merge in the future – why you did what you did, if it's not obvious.
cs: Není-li zcela zřejmé co a proč jste udělali, můžete zprávu doplnit o detaily, jak jste konflikt vyřešili -- pokud si myslíte, že by to v budoucnu mohlo při zkoumání obsahu této revize vzniklé sloučením nějak pomoci.

source: You can modify these limits with the `gc.auto` and `gc.autopacklimit` config settings, respectively.
cs: Tyto hodnoty můžete změnit podle svých potřeb v konfiguračním nastavení `gc.auto` a `gc.autopacklimit`.

source: You can name this file `expand_date` and put it in your path.
cs: Tento soubor můžete pojmenovat `expand_date` a vložit ho do svého umístění.

source: You can now sync this project to your local machine by calling `svnsync init` with the to and from repositories.
cs: Nyní můžete tento projekt synchronizovat na svůj lokální počítač zadáním příkazu `svnsync init` s uvedením repozitářů „do“ a „z“.

source: You can obviously refer to a commit by the SHA-1 hash that it’s given, but there are more human-friendly ways to refer to commits as well.
cs: Revizi můžete samozřejmě specifikovat na základě otisku SHA-1, jenž jí byl přidělen. Existují však i uživatelsky příjemnější způsoby, jak označit konkrétní revizi.

source: You can override that by specifying the `+` in front of the refspec.
cs: Odmítnutí serveru můžete potlačit zadáním znaku `+` před vzorec refspec.

source: You can pass files, directories, and file-glob patterns to the `git rm` command.
cs: Příkazu `git rm` můžete zadat soubory, adresáře a jejich masky.

source: You can pretty easily see what files have been modified in a single commit with the `--name-only` option to the `git log` command (mentioned briefly in Chapter 2):
cs: Zjistit, které soubory byly v jedné revizi změněny, lze velmi snadno pomocí příkazu `git log` s parametrem `--name-only` (stručně popsáno v kapitole 2):

source: You can provide this file to `git svn` to help it map the author data more accurately.
cs: Tento soubor můžete dát k dispozici nástroji `git svn`, aby mohl přesněji zmapovat informace o autorech.

source: You can pull the content back out of Git with the `cat-file` command.
cs: Obsah můžete ze systému Git zase vytáhnout, k tomu slouží příkaz `cat-file`.

source: You can read the value of your HEAD via this command:
cs: Hodnotu souboru HEAD můžete načíst tímto příkazem:

source: You can read trees into your staging area by calling `read-tree`.
cs: Stromy můžete do oblasti připravených změn načíst příkazem `read-tree`.

source: You can reapply the one you just stashed by using the command shown in the help output of the original stash command: `git stash apply`.
cs: Naposledy odložené soubory můžete znovu aplikovat příkazem, který byl uveden už v nápovědě ve výstupu původního příkazu stash: `git stash apply`.

source: You can rebase the server branch onto the `master` branch without having to check it out first by running `git rebase [basebranch] [topicbranch]` – which checks out the topic branch (in this case, `server`) for you and replays it onto the base branch (`master`):
cs: Větev `server` můžete přeskládat na větev `master` -- aniž byste se na ni nejdříve museli nejdříve přepnout -- tak, že provedete `git rebase [základna] [tématická větev]` -- provede se tím přepnutí na tématickou větev (checkout, v tomto případě na větev `server`) a přeskládá její změny na základnu (angl. base branch, v tomto případě `master`):

source: You can remove the `client` and `server` branches because all the work is integrated and you don't need them anymore, leaving your history for this entire process looking like <<rbdiag_i>>:
cs: Větve `client` a `server` můžete smazat, protože všechna práce z nich je integrována a tyto větve už nebudete potřebovat. Historie celého procesu bude vypadat jako na obrázku <<rbdiag_i>>:

source: You can remove these comments and type your commit message, or you can leave them there to help you remember what you're committing.
cs: Tyto komentáře můžete odstranit a napsat vlastní zprávu k revizi, nebo je můžete v souboru ponechat, abyste si lépe vzpomněli, co vlastně zapisujete.

source: You can run `git status` again to verify that all conflicts have been resolved:
cs: Ještě jednou můžete spustit příkaz `git status`, abyste si ověřili, že byly všechny konflikty vyřešeny:

source: You can run `git svn fetch` to grab the new data, but `git svn rebase` does the fetch and then updates your local commits.
cs: Nová data sice můžete vyzvednout i příkazem `git svn fetch`, avšak příkaz `git svn rebase` data nejen stáhne, ale navíc aktualizuje vaše lokální revize.

source: You can run auto gc manually as follows:
cs: Příkaz auto gc můžete spustit také ručně:

source: You can run rebase interactively by adding the `-i` option to `git rebase`.
cs: Interaktivní režim přeskládání spustíte příkazem `git rebase` s parametrem `-i`.

source: You can run something like `git log 1a410e` to look through your whole history, but you still have to remember that `1a410e` is the last commit in order to walk that history to find all those objects.
cs: Chcete-li si prohlédnout celou svou historii, můžete zadat příkaz `git log 1a410e`. Problém je v tom, že si k prohlížení historie a nalezení objektů stále ještě musíte pamatovat, že poslední revizí byla `1a410e`.

source: You can run tests or otherwise inspect the working tree with this script.
cs: Tímto skriptem lze spouštět různé testy nebo jinak kontrolovat pracovní strom.

source: You can run your tests, make sure the hotfix is what you want, and merge it back into your `master` branch to deploy to production.
cs: Můžete spustit testy, abyste se ujistili, že oprava splňuje všechny požadavky, a pak můžete větev začlenit (merge) zpět do větve `master`, aby mohla být nasazena k používání.

source: You can save a stash on one branch, switch to another branch later, and try to reapply the changes.
cs: Odklad můžete uložit na jedné větvi, později přepnout na jinou větev a aplikovat změny tam.

source: You can see a file in the `objects` directory.
cs: Vidíte, že v adresáři `objects` přibyl nový soubor.

source: You can see how powerful this technique can be for customized applications.
cs: Zde vidíte, jak může být tato metoda účinná pro uživatelsky nastavené aplikace.

source: You can see that it applied cleanly and automatically created the new commit for you.
cs: Jak vidíte, záplata byla aplikována čistě a automaticky byla vytvořena nová revize.

source: You can see that the changes have been reverted.
cs: Jak vidíte, změny byly vráceny zpět.

source: You can see that the commit has given you some output about itself: which branch you committed to (`master`), what SHA-1 checksum the commit has (`463dc4f`), how many files were changed, and statistics about lines added and removed in the commit.
cs: Vidíte, že se po zapsání revize zobrazil výpis s informacemi: do jaké větve jste revizi zapsali (`master`), jaký má revize kontrolní součet SHA-1 (`463dc4f`), kolik souborů bylo změněno a statistiku přidaných a odstraněných řádků revize.

source: You can see that the default commit message contains the latest output of the `git status` command commented out and one empty line on top.
cs: Jak vidíte, výchozí zpráva k revizi obsahuje zakomentovaný aktuální výstup příkazu `git status` a nahoře jeden prázdný řádek.

source: You can see that you've tagged the commit:(((git commands, tag)))
cs: Můžete se podívat, že revize byla označena:(((git příkazy, tag)))

source: You can see that your new README file is untracked, because it's under the ``Untracked files'' heading in your status output.
cs: Vidíte, že nový soubor `README` není sledován, protože je ve výpisu stavů uveden v části „Untracked files“.

source: You can see the ``master'' and ``testing'' branches that are right there next to the `f30ab` commit.
cs: Vedle otisku revize `f30ab` vidíte větve `master` a `testing`.

source: You can see the tag data along with the commit that was tagged by using the `git show` command:
cs: Po zadání příkazu `git show` se informace značky zobrazí spolu s revizí, kterou značka označuje:

source: You can see your reflog by using `git reflog`:
cs: Svůj reflog si můžete nechat zobrazit příkazem `git reflog`:

source: You can set up an attribute like this:
cs: V tom případě můžete nastavit tento atribut:

source: You can start up interactive Ruby mode with the `irb` command:
cs: Interaktivní režim Ruby spustíte příkazem `irb`:

source: You can take the changes on client that aren't on server (`C8` and `C9`) and replay them on your `master` branch by using the `--onto` option of `git rebase`:
cs: Můžete vzít změny na větvi `client`, které nejsou na větvi `server` (`C8` a `C9`) a aplikovat je na větev `master` příkazem `git rebase` s volbou `--onto`:

source: You can tell Git not to export certain files or directories when generating an archive.
cs: Systému Git můžete zadat, aby při generování archivu neexportoval určité soubory nebo adresáře.

source: You can tell Git to convert CRLF to LF on commit but not the other way around by setting `core.autocrlf` to input:
cs: Systému Git tak můžete zadat, aby převáděl posloupnosti CRLF na LF (avšak nikoli obráceně) nastavením `core.autocrlf` na hodnotu input:

source: You can tell Git which of these you want enabled by setting `core.whitespace` to the values you want on or off, separated by commas.
cs: Které z těchto funkcí si přejete zapnout a které vypnout, to můžete systému Git sdělit zadáním čárkami oddělených hodnot do parametru `core.whitespace`.

source: You can tell that it's staged because it's under the ``Changes to be committed'' heading.
cs: Můžeme říci, že je připraven k zapsání, protože je uveden v části „Changes to be committed“, tedy „Změny k zapsání“.

source: You can then clone the code by running
cs: Zdrojový kód pak naklonujete příkazem

source: You can then run this program and pipe its output through `git fast-import`.
cs: Tento program můžete spustit a jeho výstup nechat zpracovat příkazem `git fast-import`.

source: You can throw away the original `iss91` branch (losing commits `C5` and `C6`) and merge in the other two.
cs: Původní větev `iss91` můžete zahodit (s ní i revize `C5` a `C6`) a začlenit zbylé dvě větve.

source: You can turn on this functionality with the `core.autocrlf` setting.
cs: Tato funkce se zapíná pomocí parametru `core.autocrlf`.

source: You can use this hook to disallow rebasing any commits that have already been pushed.
cs: Zásuvný modul můžete využít i k zakázání přeskládání všech revizí, které už byly odeslány.

source: You can zlib-uncompress it, strip off the header, and look at the commit content:
cs: Objekt můžete rozbalit, extrahovat záhlaví a prohlédnout si obsah revize:

source: You can't lose information in transit or get file corruption without Git being able to detect it.
cs: Nemůže tak dojít ke ztrátě informací při přenosu dat nebo k poškození souboru, aniž by to Git byl schopen zjistit.

source: You can't really check out a tag in Git, since they can't be moved around.
cs: V Gitu nemůžete získat pracovní kopii (check out) jen na základě značky (tag), protože značka se nedá posouvat.

source: You clone a repository with `git clone [url]`.(((git commands, clone))) For example, if you want to clone the Git linkable library called libgit2, you can do so like this:
cs: Repozitář naklonujete příkazem `git clone [url]`.(((git příkazy, clone))) Pokud například chcete naklonovat gitovou knihovnu zvanou libgit2, můžete to provést následovně:

source: You could do that like this: `$ git fetch --all; git branch -vv`
cs: Můžete to provést následovně: `$ git fetch --all; git branch -vv`

source: You created and switched to a branch, did some work on it, and then switched back to your main branch and did other work.
cs: Vytvořili jste novou větev, přepnuli se na ni, provedli změny a poté jste přepnuli zpět na hlavní větev, v níž jste provedli další změny.

source: You did a few commits on them and deleted them directly after merging them into your main branch.
cs: Zapsali jste do nich pár revizí a smazali jste je hned po začlenění změn do hlavní větve.

source: You do a commit, which takes the files as they are in the staging area and stores that snapshot permanently to your Git directory.
cs: Provedete zápis (commit), který vezme soubory nacházející se v oblasti připravených změn, a tento snímek trvale uloží do adresáře Gitu.

source: You do that by having Git compare the last commit on your topic branch with the first common ancestor it has with the master branch.
cs: Tohoto srovnání dosáhnete tak, že necháte Git porovnat poslední revizi ve vaší tématické větvi s prvním předkem, kterého má společného s hlavní větví.

source: You do this by telling Git how to convert your binary data to a text format that can be compared via the normal diff.
cs: Dosáhnete toho tím, že systému Git sdělíte, jak má konvertovat binární data do textového formátu, který lze zpracovávat běžným algoritmem pro zjišťování rozdílů (diff).

source: You do this with the `git branch` command:(((git commands, branch)))
cs: Učiníte tak příkazem `git branch`:(((git commands, branch)))

source: You do this with the `git merge` command:(((git commands, merge)))
cs: Učiníte tak příkazem `git merge`:(((git příkazy, merge))))

source: You do want to start including README, so let's start tracking the file.
cs: Vy si ale přejete soubor README do snímku zahrnout, a proto ho začněme sledovat.

source: You end up with a single commit – the second commit replaces the results of the first.
cs: Výsledkem je jediná revize -- druhý příkaz `commit` nahradí výsledky prvního.

source: You fetch it and merge the new remote branch into your work, making your history look something like this:
cs: Vy tyto změny vyzvednete a začleníte novou vzdálenou větev do své práce -- vaše historie teď vypadá nějak takto:

source: You get a list of commits that have already been pushed up by running this:
cs: Seznam revizí, které už byly odeslány, získáte takto:

source: You get a list of new commits being pushed to your server with `git rev-list`.
cs: Příkazem `git rev-list` získáte výpis nových revizí odesílaných na váš server.

source: You go back to your code, and it turns out you can reproduce the issue, but you can’t figure out what is going wrong.
cs: Vrátíte se zpět ke svému kódu, a ukáže se, že dokážete problém reprodukovat, ne však identifikovat.

source: You hardcode the time zone (-0700) because doing so is easy.
cs: Časové pásmo definujete napevno (-0700), protože je to jednoduché.

source: You have a bona fide Git repository and a checkout or working copy of the files for that project.
cs: Nyní máte k dispozici opravdový gitový repozitář a pracovní kopii souborů projektu.

source: You have a lot of options at this point.
cs: V tomto se nabízí celá řada možností.

source: You have several options to get a remote Git repository up and running so that you can collaborate with others or share your work.
cs: Existuje několik možností, jak vytvořit a zprovoznit vzdálený gitový repozitář tak, abyste mohli spolupracovat s ostatními uživateli nebo sdílet svou práci.

source: You have three trees that specify the different snapshots of your project that you want to track, but the earlier problem remains: you must remember all three SHA-1 values in order to recall the snapshots.
cs: Máte vytvořeny tři stromy označující různé snímky vašeho projektu, jež chcete sledovat. Původního problému jsme se však stále nezbavili: musíte si pamatovat všechny tři hodnoty SHA-1, abyste mohli snímky znovu vyvolat.

source: You have to change the path to the ACL file from this
cs: Cestu k souboru ACL budete muset změnit z

source: You have to figure out how to get the commit message from each of these commits to test.
cs: Budete muset najít postup, jak získat zprávy všech těchto revizí, které mají být otestovány.

source: You have to merge it manually into your work when you're ready.
cs: Sloučení s vaší prací musíte udělat ručně, až to uznáte za vhodné.

source: You have to set it up.
cs: To budete muset nastavit.

source: You have your tree object, so you continue walking your commits.
cs: Stáhli jste objekt stromu, a můžete tak pokračovat v procházení revizí.

source: You may also include a log, tmp, or pid directory; automatically generated documentation; and so on.
cs: Můžete rovněž přidat adresáře `log`, `tmp` nebo `pid`, automaticky vygenerovanou dokumentaci a další.

source: You may be wondering what the difference is between _author_ and _committer_.
cs: Možná se ptáte, jaký je rozdíl mezi _autorem_ a _autorem revize_.

source: You may even want to add a `pre-receive` hook that checks each commit message for a `git-svn-id` and rejects pushes that contain commits without it.
cs: Možná by nebylo od věci ani vytvořit zásuvný modul `pre-receive`, který by kontroloval všechny zprávy k revizím, zda obsahují `git-svn-id`, a odmítl by všechna odeslání, která obsahují revize bez něj.

source: You may not want to run `adduser` and set temporary passwords for every user.
cs: Možná nebudete mít chuť spouštět příkaz `adduser` (přidat uživatele) a nastavovat pro každého uživatele dočasná hesla.

source: You may recall that when you ran `git init` earlier, you then ran `git add (files)` – that was to begin tracking files in your directory.(((git commands, init)))(((git commands, add))) The `git add` command takes a path name for either a file or a directory; if it's a directory, the command adds all the files in that directory recursively.
cs: Možná si vzpomínáte, že když jste před časem spustili příkaz `git init`, provedli jste potom příkaz `git add (soubory)`.(((git příkazy, init)))(((git příkazy, add))) V příkazu `git add` je uvedena cesta buď k souboru, nebo k adresáři. Pokud se jedná o adresář, příkaz přidá rekurzivně všechny soubory v tomto adresáři.

source: You may see keys more than once, because Git reads the same key from different files (`/etc/gitconfig` and `~/.gitconfig`, for example).
cs: Některé klíče se mohou objevit víckrát, protože Git načítá stejný klíč z různých souborů (například z `/etc/gitconfig` a z `~/.gitconfig`).

source: You may think to run this:
cs: Můžete zadat následující příkaz:

source: You may use it in conjunction with a commit template to programmatically insert information.
cs: Zásuvný modul můžete v kombinaci se šablonou revize využívat k vložení informací programem.

source: You modify files in your working directory.
cs: Změníte soubory ve svém pracovním adresáři.

source: You must have around 7,000 loose objects or more than 50 packfiles for Git to fire up a real gc command.
cs: Aby Git spustil skutečný příkaz gc, musíte mít kolem 7000 volných objektů nebo více než 50 balíčkových souborů.

source: You must indicate how far back you want to rewrite commits by telling the command which commit to rebase onto.
cs: Musíte specifikovat, jak hluboko do historie se chcete vrátit a přepisovat revize. K příkazu proto musíte zadat, na jakou revizi si přejete přeskládání provést.
